Wishlist-backend/app/controllers/application_controller.rb

    def authorized
        @current_profile = Profile.find_by(id: session[:profile_id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" IS NULL LIMIT ?  [["LIMIT", 1]]