Wishlist-backend/app/controllers/gifts_controller.rb

    def index
        gift = Gift.all
---
SELECT "gifts".* FROM "gifts"

    def show
        profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]