Wishlist-backend/app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles"
---
    def index
        render json: Profile.all

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        current_profile = Profile.find(id: session[:profile_id])

INSERT INTO "profiles" ("name", "username", "password_digest", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        profile = Profile.create!(profile_params)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "profiles" SET "passcode" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["passcode", "joe1"], ["updated_at", "2022-12-07 20:41:15.817869"], ["id", 4]]
---
    def update
        profile = Profile.find(params[:id])
        profile.update!(update_params)

DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 6]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def destroy
        profile = Profile.find(params[:id]).destroy