Wishlist-backend/app/controllers/sessions_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."username" = ? LIMIT ?  [["username", "joe"], ["LIMIT", 1]]
---
    def create

        profile = Profile.find_by(username: params[:username])

DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 7]]
---
    def destroy

        session.delete :profile_id