server/app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        profile = Profile.find(params[:id])